/**
 * 指定されたミリ秒の間、処理を停止します。
 */
export const sleep = (ms: number) => new Promise(resolve => setTimeout(resolve, ms));

/**
 * 指定された長さのランダムな英数字を生成します。
 */
export const generateRandomString = (length: number): string => {
    const chars = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789';
    let result = '';
    for (let i = 0; i < length; i++) {
        result += chars.charAt(Math.floor(Math.random() * chars.length));
    }
    return result;
};

/**
 * 指定された数のランダムな絵文字を生成します。
 */
export const generateRandomEmojis = (count: number): string => {
    const emojis = ['😀','🤣','😍','😘','🥰','😊','😋','😎','🤔','🤨','😐','😑','😴','🤤','😫','😭','😱','😡','🤢','🥳','🤡','👻','💀','👽','💖','👋','👌','✌️','🤞','🤙','👍','👎','👏','🙌','👐','🙏','🤝','🤳','💪','🦾','👂','👀','🧠','🦶','🏃','💃','🚶','🧘','👶','🧑‍💻','🐶','🐱','🐭','🐹','🐰','🦊','🐻','🐼','🦁','🐮','🐷','🐵','🐧','🐦','🐤','🦆','🦖','🐙','🦋','🌸','🌻','🌲','🌵','🌙','☀️','🍎','🍐','🍊','🍋','🍌','🍉','🍇','🍓','🍒','🍑','🍍','🥥','🥝','🍔','🍟','🍕','🌭','🍣','🍱','🍦','🍩','🎂','🍺','🍷','☕','⚽','🏀','🏈','⚾','🎾','🏐','🎱','🏓','🏸','🥅','🏒','🏂','⛷️','🏄','🏊','🏋️','🎮','🕹️','🎨','🎭','🎸','🎺','🏆','🎫','🚗','🚕','🚌','🏎️','🚓','🚑','🚒','🚲','🛵','🚂','✈️','🚀','🛸','🚁','🚢','🏠','🏢','🏬','🏟️','🗼','🗻','🏖️','🏕️','🎡','🌃','💡','🕯️','💻','🖥️','⌨️','🖱️','📱','🔋','🖨️','📷','📺','📸','📀','📼','📚','✉️','📦','🖊️','🔑','🔨','⚒️','🛡️','🛏️','🛀','❤️','🧡','💛','💚','💙','💜','🖤','🤍','🤎','💔','❣️','❓','❗','⚠️','⛔','🚫','✅','🆗','🆙','♻️','🚻','🎶','🎵','🇯🇵','🇺🇸','🚩','🏁','🌈','🍀','⚡','✨','🌟','🔥','💥','💢','💨','💦','💤'];
    let result = '';
    for (let i = 0; i < count; i++) {
        result += emojis[Math.floor(Math.random() * emojis.length)];
    }
    return result;
};
